---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.IconIndexParam
source: html/45675f67-1bbf-d278-56fa-acb55feb99bf.htm
---
# Autodesk.Revit.DB.ParameterTypeId.IconIndexParam Property

"Index Into Image File Name Array (for Use with XAML)"

## Syntax (C#)
```csharp
public static ForgeTypeId IconIndexParam { get; }
```